//Условные и логические операторы

//Задание 1.1

// let x = prompt("Введите число");
// if (x > 0) {
//     console.log("Вы ввели положительное число");
// }
// if (x < 0) {
//     console.log("Вы ввели отрицательное число");
// }
// if (x === 0) {
//     console.log("Вы ввели 'ноль'");
// }

//Задание 1.2

// let a = prompt("Введите число для переменной 'a'");
// let b = prompt("Введите число для переменной 'b'");
// let c = prompt("Введите число для переменной 'c");

// let min =
//     a < b
//         ? a < c
//             ? alert(`Имя переменной a = ${a}`)
//             : b < c
//             ? alert(`Имя переменной b = ${b}`)
//             : alert(`Имя переменной c = ${c}`)
//         : b < c
//         ? alert(`Имя переменной b = ${b}`)
//         : alert(`Имя переменной c = ${c}`);

//Задание 1.3

// let iHave = prompt("Сколько у меня в кармане денег?");
// let atMyFriend = prompt("Сколько у моего друга в кармане денег?");
// let whatAreWeDoing = iHave + atMyFriend > 1000 ? alert("Едем на Майорку") : alert("Пьем пиво");

//Задание 1.4

// let age = prompt("Возраст человека?");
// 20 <= age && age < 27 ? alert("Выслать повестку") : false;

//Задание 1.5
